In [2]:
import findspark
findspark.init()
from pyspark.sql import SparkSession
spark = SparkSession.builder.getOrCreate()

In [3]:
spark.version

'3.5.2'

In [4]:
from pyspark.sql.functions import col, explode

# 1. Cities table

In [64]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_0_20250320_112647.json")

In [65]:
df.show()

+--------------------+-------------------+
|                data|         pagination|
+--------------------+-------------------+
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|
+--------------------+-------------------+

In [66]:
df2 = df.withColumn("explodedarray", explode(col("data")))

In [67]:
df2.show()

+--------------------+-------------------+--------------------+
|                data|         pagination|       explodedarray|
+--------------------+-------------------+--------------------+
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{1, Anaa, PF, NUL...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{2, Arrabury, AU,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{3, El Arish, EG,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{4, Annaba, DZ, 2...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{5, Apalachicola,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{6, Arapoti, BR, ...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{7, Aachen, DE, 3...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{8, Arraias, BR, ...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{9, Awaradam, SR,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{10, Aranuka, KI,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{11, Aalborg, DK,...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{12, Mala Mala, Z...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{13, Al Ain, AE, ...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{14, Anaco, VE, 3...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{15, Anapa, RU, 5...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{16, Aarhus, DK, ...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{17, Apalapsili, ...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{18, Altay, CN, 1...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{19, Asau, WS, 40...|
|[{1, Anaa, PF, NU...|{100, 100, 0, 9374}|{20, Surallah, PH...|
+--------------------+-------------------+--------------------+
only showing top 20 rows

In [68]:
df2.createOrReplaceTempView("table")

In [77]:
df3 = spark.sql(
    """
        SELECT DISTINCT
            explodedarray.*
        FROM table
        WHERE explodedarray.country_iso2 IS NULL
    """
).show()

+-------+---------+------------+----------+---+---------+---+--------+---------+--------+
|city_id|city_name|country_iso2|geoname_id|gmt|iata_code| id|latitude|longitude|timezone|
+-------+---------+------------+----------+---+---------+---+--------+---------+--------+
+-------+---------+------------+----------+---+---------+---+--------+---------+--------+

In [123]:
df3 = spark.sql(
    """ 
    SELECT 
        COALESCE(explodedarray.city_id, 0) as city_id,
        COALESCE(explodedarray.city_name, 'Unknown') as city_name,

        COALESCE(explodedarray.iata_code, 'N/A') as iata_code,

        COALESCE(explodedarray.latitude, 0) as latitude,
        COALESCE(explodedarray.longitude, 0) as longitude,
        
        COALESCE(explodedarray.timezone, 'N/A') as timezone,
        COALESCE(explodedarray.country_iso2, 'N/A') as country_iso2
    FROM table   
    """
).show()

+-------+------------+---------+----------+----------+-------------------+------------+
|city_id|   city_name|iata_code|  latitude| longitude|           timezone|country_iso2|
+-------+------------+---------+----------+----------+-------------------+------------+
|      1|        Anaa|      AAA|    -17.05|-145.41667|     Pacific/Tahiti|          PF|
|      2|    Arrabury|      AAB|     -26.7| 141.04167| Australia/Brisbane|          AU|
|      3|    El Arish|      AAC| 31.133333|     33.75|       Africa/Cairo|          EG|
|      4|      Annaba|      AAE| 36.821392|  7.811857|     Africa/Algiers|          DZ|
|      5|Apalachicola|      AAF| 29.733334| -84.98333|    America/Chicago|          US|
|      6|     Arapoti|      AAG|-24.103611|    -49.79|  America/Sao_Paulo|          BR|
|      7|      Aachen|      AAH| 50.775438|   6.08151|      Europe/Berlin|          DE|
|      8|     Arraias|      AAI|-12.916667|-46.933334|  America/Araguaina|          BR|
|      9|    Awaradam|      AAJ|       3.9| -55.36667| America/Paramaribo|          SR|
|     10|     Aranuka|      AAK|  0.166667| 173.58333|     Pacific/Tarawa|          KI|
|     11|     Aalborg|      AAL| 57.028811|  9.917771|  Europe/Copenhagen|          DK|
|     12|   Mala Mala|      AAM|     -24.8| 31.533333|Africa/Johannesburg|          ZA|
|     13|      Al Ain|      AAN|   24.2075| 55.744722|         Asia/Dubai|          AE|
|     14|       Anaco|      AAO|  9.431944| -64.46389|    America/Caracas|          VE|
|     15|       Anapa|      AAQ|      44.9| 37.316666|      Europe/Moscow|          RU|
|     16|      Aarhus|      AAR| 56.162939| 10.203921|  Europe/Copenhagen|          DK|
|     17|  Apalapsili|      AAS| -3.916667|    139.25|      Asia/Jayapura|          ID|
|     18|       Altay|      AAT| 47.750362|  88.08444|      Asia/Shanghai|          CN|
|     19|        Asau|      AAU|-13.458333|    -172.6|       Pacific/Apia|          WS|
|     20|    Surallah|      AAV|  6.333333| 124.76667|        Asia/Manila|          PH|
+-------+------------+---------+----------+----------+-------------------+------------+
only showing top 20 rows

# 2. Countries Table

In [148]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_101_20250320_114525.json")

In [149]:
df.show()

+--------------------+--------------------+
|                data|          pagination|
+--------------------+--------------------+
|[{Budapest, EU, 1...|{100, 100, 101, 252}|
+--------------------+--------------------+

In [150]:
df = df.withColumn("explodedarray", explode(col('data')))

In [151]:
df.createOrReplaceTempView("table")

In [154]:
df3 = spark.sql(
    """ 
    SELECT 
         explodedarray.*
    FROM table   
    WHERE 
        explodedarray.country_iso3 IS NULL
    """
).show()

+-------+---------+----------+------------+------------+-------------------+------------+-------------+-------------+---------+---+------------+----------+
|capital|continent|country_id|country_iso2|country_iso3|country_iso_numeric|country_name|currency_code|currency_name|fips_code| id|phone_prefix|population|
+-------+---------+----------+------------+------------+-------------------+------------+-------------+-------------+---------+---+------------+----------+
+-------+---------+----------+------------+------------+-------------------+------------+-------------+-------------+---------+---+------------+----------+

In [ ]:
df2 = spark.sql(
    """ 
    SELECT 
        COALESCE(explodedarray.country_name, 'Unknown') as country_name,
        COALESCE(explodedarray.country_iso2, 'N/A') as country_iso2,
        COALESCE(explodedarray.capital, 'Unknown') as capital,
        COALESCE(explodedarray.continent, 'Unknown') as continent,
        COALESCE(explodedarray.currency_name, 'Unknown') as currency_name,
        COALESCE(explodedarray.population, 0) as population,
        COALESCE(explodedarray.phone_prefix, "Unknown") as phone_prefix
    FROM table   
    """
).show()

+----------+--------------------+------------+--------------------+---------+-------------+----------+------------+
|country_id|        country_name|country_iso2|             capital|continent|currency_name|population|phone_prefix|
+----------+--------------------+------------+--------------------+---------+-------------+----------+------------+
|       102|             Hungary|          HU|            Budapest|       EU|       Forint|   9982000|          36|
|       103|           Indonesia|          ID|             Jakarta|       AS|       Rupiah| 242968342|          62|
|       104|             Ireland|          IE|              Dublin|       EU|         Euro|   4622917|         353|
|       105|              Israel|          IL|           Jerusalem|       AS|       Shekel|   7353985|         972|
|       106|         Isle of Man|          IM|Douglas, Isle of Man|       EU|        Pound|     75049|    +44-1624|
|       107|               India|          IN|           New Delhi|       AS|        Rupee|1173108018|          91|
|       108|British Indian Oc...|          IO|        Diego Garcia|       AS|       Dollar|      4000|         246|
|       109|                Iraq|          IQ|             Baghdad|       AS|        Dinar|  29671605|         964|
|       110|                Iran|          IR|              Tehran|       AS|         Rial|  76923300|          98|
|       111|             Iceland|          IS|           Reykjavik|       EU|        Krona|    308910|         354|
|       112|               Italy|          IT|                Rome|       EU|         Euro|  60340328|          39|
|       113|              Jersey|          JE|        Saint Helier|       EU|        Pound|     90812|    +44-1534|
|       114|             Jamaica|          JM|            Kingston|       NA|       Dollar|   2847232|      +1-876|
|       115|              Jordan|          JO|               Amman|       AS|        Dinar|   6407085|         962|
|       116|               Japan|          JP|               Tokyo|       AS|          Yen| 127288000|          81|
|       117|               Kenya|          KE|             Nairobi|       AF|     Shilling|  40046566|         254|
|       118|          Kyrgyzstan|          KG|             Bishkek|       AS|          Som|   5508626|         996|
|       119|            Cambodia|          KH|          Phnom Penh|       AS|        Riels|  14453680|         855|
|       120|            Kiribati|          KI|              Tarawa|       OC|       Dollar|     92533|         686|
|       121|             Comoros|          KM|              Moroni|       AF|        Franc|    773407|         269|
+----------+--------------------+------------+--------------------+---------+-------------+----------+------------+
only showing top 20 rows

# 3. Airplanes Table:

In [196]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_1010_20250320_124911.json")

In [197]:
df.show()

+--------------------+--------------------+
|                data|          pagination|
+--------------------+--------------------+
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|
+--------------------+--------------------+

In [198]:
df = df.withColumn("explodedarray", explode(col('data')))

In [199]:
df.show()

+--------------------+--------------------+--------------------+
|                data|          pagination|       explodedarray|
+--------------------+--------------------+--------------------+
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{6R, NULL, 1011, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{6R, NULL, 1012, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{6R, NULL, 1013, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{6R, NULL, 1014, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{6R, NULL, 1015, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1016, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1017, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1018, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1019, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1020, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1021, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1022, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1023, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1024, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1025, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1026, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1027, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1028, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1029, ...|
|[{6R, NULL, 1011,...|{100, 100, 1010, ...|{7C, NULL, 1030, ...|
+--------------------+--------------------+--------------------+
only showing top 20 rows

In [200]:
df.createOrReplaceTempView("table")

In [201]:
df3 = spark.sql(
    """ 
        SELECT 
            explodedarray.*
        FROM table   
        WHERE 
            explodedarray.registration_number IS NULL
    """
).show()

+-----------------+-----------------+-----------+-------------------+-------------+-------------+------------+-----------------+--------------+---------------+---------+-------------+---+-----------+----------+----------+---------+-----------+-----------+------------+------------+---------------+-----------------+-------------------+------------+------------------------+
|airline_iata_code|airline_icao_code|airplane_id|construction_number|delivery_date|engines_count|engines_type|first_flight_date|iata_code_long|iata_code_short|iata_type|icao_code_hex| id|line_number|model_code|model_name|plane_age|plane_class|plane_owner|plane_series|plane_status|production_line|registration_date|registration_number|rollout_date|test_registration_number|
+-----------------+-----------------+-----------+-------------------+-------------+-------------+------------+-----------------+--------------+---------------+---------+-------------+---+-----------+----------+----------+---------+-----------+-----------+------------+------------+---------------+-----------------+-------------------+------------+------------------------+
+-----------------+-----------------+-----------+-------------------+-------------+-------------+------------+-----------------+--------------+---------------+---------+-------------+---+-----------+----------+----------+---------+-----------+-----------+------------+------------+---------------+-----------------+-------------------+------------+------------------------+

In [154]:
df2 = spark.sql(
    """ 
        SELECT 
            COALESCE(explodedarray.registration_number, 'Unknown') as registration_number,
            COALESCE(explodedarray.model_name, 'Unknown') as model_name,
            COALESCE(explodedarray.model_code, 'Unknown') as model_code,
            COALESCE(explodedarray.plane_owner, 'Unknown') as plane_owner,


            COALESCE(explodedarray.construction_number, 0) as construction_number,
            COALESCE(explodedarray.production_line, 'Unknown') as production_line,
            COALESCE(explodedarray.iata_type, 'Unknown') as iata_type,

            COALESCE(explodedarray.first_flight_date, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) as first_flight_date,
            COALESCE(explodedarray.delivery_date, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) as delivery_date,

            COALESCE(explodedarray.plane_series, 'Unknown') as plane_series,
            COALESCE(explodedarray.engines_count, 0) as engines_count,
            COALESCE(explodedarray.engines_type, 'Unknown') as engines_type,
            COALESCE(explodedarray.plane_age, 0) as plane_age,
            COALESCE(explodedarray.plane_status, 'Unknown') as plane_status

        FROM table   
    """
).show()

+-------------------+----------+-------------+--------------------+-------------------+----------------+---------+--------------------+--------------------+------------+-------------+------------+---------+------------+
|registration_number|model_name|   model_code|         plane_owner|construction_number| production_line|iata_type|   first_flight_date|       delivery_date|plane_series|engines_count|engines_type|plane_age|plane_status|
+-------------------+----------+-------------+--------------------+-------------------+----------------+---------+--------------------+--------------------+------------+-------------+------------+---------+------------+
|             XA-FPP|      A300|A300B4-203(F)|Wells Fargo Bank ...|                227|Airbus A300/A310|   A300B4|1983-02-28T23:00:...|1982-12-20T23:00:...|     B4-203F|            2|         JET|       34|      active|
|             XA-LRC|       767|B767-241(ERF)|Wells Fargo Bank ...|              23802|      Boeing 767| B767-200|1987-04-27T22:00:...|1987-07-01T22:00:...|      241ERF|            2|         JET|       30|      active|
|             XA-LRL|      A300|A300B4-203(F)|             Unknown|                210|Airbus A300/A310|   A300B4|1982-09-09T22:00:...|1985-05-09T22:00:...|     B4-203F|            2|         JET|       35|      active|
|             XA-MRC|      A300|A300B4-203(F)|             Unknown|                247|Airbus A300/A310|   A300B4|1983-09-08T22:00:...|1984-12-20T23:00:...|     B4-203F|            2|         JET|       34|      active|
|             XA-TWQ|      A300|A300B4-203(F)|Lombard Aviation ...|                045|Airbus A300/A310|   A300B4|1977-02-17T23:00:...|1977-03-23T23:00:...|     B4-203F|            2|         JET|       40|      active|
|             HL7779|       737|     B737-85F|GATX 737-800 Part...|              28824|   Boeing 737 NG| B737-800|1998-12-17T23:00:...|1999-02-01T23:00:...|         85F|            2|         JET|       18|      active|
|             HL7780|       737|     B737-85F|Mall Partners I B.V.|              28827|   Boeing 737 NG| B737-800|2000-01-06T23:00:...|2000-01-28T23:00:...|         85F|            2|         JET|       17|      active|
|             HL8019|       737| B737-86NWIN.|               GECAS|              32694|   Boeing 737 NG| B737-800|2006-05-25T22:00:...|2006-06-11T22:00:...|         86N|            2|         JET|       11|      active|
|             HL8020|       737|     B737-86N|Wells Fargo Bank ...|              32683|   Boeing 737 NG| B737-800|2006-12-04T23:00:...|2006-12-17T23:00:...|         86N|            2|         JET|       10|      active|
|             HL8031|       737| B737-8GJWIN.|Wells Fargo Bank ...|              37361|   Boeing 737 NG| B737-800|2010-12-11T23:00:...|2010-12-22T23:00:...|         8GJ|            2|         JET|        6|      active|
|             HL8032|       737| B737-8GJWIN.|BBAM Aircraft Hol...|              36367|   Boeing 737 NG| B737-800|2010-03-09T23:00:...|2010-03-24T23:00:...|         8GJ|            2|         JET|        7|      active|
|             HL8033|       737| B737-8ALWIN.|Singapore Aircraf...|              35071|   Boeing 737 NG| B737-800|2006-12-11T23:00:...|2006-12-20T23:00:...|         8AL|            2|         JET|       10|      active|
|             HL8034|       737| B737-8HXWIN.|Bank of Utah Trustee|              38101|   Boeing 737 NG| B737-800|2011-09-28T22:00:...|2011-10-18T22:00:...|         8HX|            2|         JET|        6|      active|
|             HL8206|       737| B737-86JWIN.|             Unknown|              30877|   Boeing 737 NG| B737-800|2001-02-11T23:00:...|2001-03-03T23:00:...|         86J|            2|         JET|       16|      active|
|             HL8214|       737| B737-86NWIN.|             Unknown|              28608|   Boeing 737 NG| B737-800|1999-10-17T22:00:...|1999-11-11T23:00:...|         86N|            2|         JET|       18|      active|
|             HL8234|       737| B737-86QWIN.|Boullion Aviation...|              30285|   Boeing 737 NG| B737-800|2002-10-22T22:00:...|2002-11-13T23:00:...|         86Q|            2|         JET|       15|      active|
|             HL8239|       737|     B737-82R|    Pegasus Airlines|              29344|   Boeing 737 NG| B737-800|2001-05-03T22:00:...|2001-05-20T22:00:...|         82R|            2|         JET|       16|      active|
|             HL8260|       737| B737-8BKWIN.|CIT Leasing Corpo...|              30622|   Boeing 737 NG| B737-800|2002-03-25T23:00:...|2002-04-14T22:00:...|         8BK|            2|         JET|       15|      active|
|             HL8261|       737| B737-8BKWIN.|CIT Leasing Corpo...|              30624|   Boeing 737 NG| B737-800|2002-07-25T22:00:...|2002-08-13T22:00:...|         8BK|            2|         JET|       15|      active|
|             HL8263|       737| B737-82RWIN.|International Lea...|              30658|   Boeing 737 NG| B737-800|2003-05-06T22:00:...|2003-05-21T22:00:...|         82R|            2|         JET|       14|      active|
+-------------------+----------+-------------+--------------------+-------------------+----------------+---------+--------------------+--------------------+------------+-------------+------------+---------+------------+
only showing top 20 rows

# 4. Airports Table

In [202]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_1111_20250320_121457.json")

In [203]:
df.show()

+--------------------+--------------------+
|                data|          pagination|
+--------------------+--------------------+
|[{1465, Cotulla, ...|{100, 100, 1111, ...|
+--------------------+--------------------+

In [204]:
df= df.withColumn("explodedarray", explode(col('data')))
df.show()

+--------------------+--------------------+--------------------+
|                data|          pagination|       explodedarray|
+--------------------+--------------------+--------------------+
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1465, Cotulla, C...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1466, Columbia R...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1467, Covilha, C...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1472, A. Tubman,...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1473, Capurgana,...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1474, Chapelco, ...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1475, Coober Ped...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1476, Campeche I...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1477, Cepu, CPF,...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1479, Kastrup, C...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1481, Chaparral,...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1482, Compton, C...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1484, Chamonate,...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1485, Campo dos ...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1486, Natrona Co...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1487, St. Louis ...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1488, Cape Town ...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1489, Cururupu, ...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1490, Joao Suass...|
|[{1465, Cotulla, ...|{100, 100, 1111, ...|{1491, Culebra, C...|
+--------------------+--------------------+--------------------+
only showing top 20 rows

In [205]:
df.createOrReplaceTempView("table")

In [207]:
df3 = spark.sql(
    """ 
    SELECT 
        explodedarray.*
    FROM table
    WHERE explodedarray.iata_code IS NULL   
    """
).show()

+----------+------------+--------------+------------+------------+----------+---+---------+---------+---+--------+---------+------------+--------+
|airport_id|airport_name|city_iata_code|country_iso2|country_name|geoname_id|gmt|iata_code|icao_code| id|latitude|longitude|phone_number|timezone|
+----------+------------+--------------+------------+------------+----------+---+---------+---------+---+--------+---------+------------+--------+
+----------+------------+--------------+------------+------------+----------+---+---------+---------+---+--------+---------+------------+--------+

In [30]:
df2 = spark.sql(
    """ 
    SELECT 
        COALESCE(explodedarray.airport_id, 0) as airport_id,
        COALESCE(explodedarray.airport_name, 'Unknown') as airport_name,
        COALESCE(explodedarray.iata_code, 'N/A') as iata_code,
        COALESCE(explodedarray.icao_code, 'N/A') as icao_code,
        COALESCE(explodedarray.city_iata_code, 'N/A') as city_iata_code,
        
        COALESCE(explodedarray.latitude, 0) as latitude,
        COALESCE(explodedarray.longitude, 0) as longitude,
        COALESCE(explodedarray.timezone, 'N/A') as timezone,

        COALESCE(explodedarray.country_iso2, 'N/A') as country_iso2,
        COALESCE(explodedarray.country_name, 'Unknown') as country_name

    FROM table
    WHERE explodedarray.icao_code IS NULL   
    """
).show()

+----------+------------+---------+---------+--------------+--------+---------+--------+------------+------------+
|airport_id|airport_name|iata_code|icao_code|city_iata_code|latitude|longitude|timezone|country_iso2|country_name|
+----------+------------+---------+---------+--------------+--------+---------+--------+------------+------------+
+----------+------------+---------+---------+--------------+--------+---------+--------+------------+------------+

# 5. Airlines Table:

In [188]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_10504_20250320_122519.json")

In [189]:
df.show()

+--------------------+--------------------+
|                data|          pagination|
+--------------------+--------------------+
|[{10506, Planemas...|{100, 100, 10504,...|
+--------------------+--------------------+

In [190]:
df= df.withColumn("explodedarray", explode(col('data')))
df.show()

+--------------------+--------------------+--------------------+
|                data|          pagination|       explodedarray|
+--------------------+--------------------+--------------------+
|[{10506, Planemas...|{100, 100, 10504,...|{10506, Planemast...|
|[{10506, Planemas...|{100, 100, 10504,...|{10507, Perm Moto...|
|[{10506, Planemas...|{100, 100, 10504,...|{10508, Premium A...|
|[{10506, Planemas...|{100, 100, 10504,...|{10509, Polizeihu...|
|[{10506, Planemas...|{100, 100, 10504,...|{10510, Petroleos...|
|[{10506, Planemas...|{100, 100, 10504,...|{10511, Pink Avia...|
|[{10506, Planemas...|{100, 100, 10504,...|{10512, Universal...|
|[{10506, Planemas...|{100, 100, 10504,...|{10513, Pan-Air, ...|
|[{10506, Planemas...|{100, 100, 10504,...|{10514, Prince Av...|
|[{10506, Planemas...|{100, 100, 10504,...|{10515, Pond Air ...|
|[{10506, Planemas...|{100, 100, 10504,...|{10516, Peninter ...|
|[{10506, Planemas...|{100, 100, 10504,...|{10517, PanAfriqi...|
|[{10506, Planemas...|{100, 100, 10504,...|{10518, Puerto Ri...|
|[{10506, Planemas...|{100, 100, 10504,...|{10519, Panh, KUB...|
|[{10506, Planemas...|{100, 100, 10504,...|{10520, Aerovias ...|
|[{10506, Planemas...|{100, 100, 10504,...|{10521, Pacific N...|
|[{10506, Planemas...|{100, 100, 10504,...|{10522, Air Pink,...|
|[{10506, Planemas...|{100, 100, 10504,...|{10523, Aero Pers...|
|[{10506, Planemas...|{100, 100, 10504,...|{10524, Panorama,...|
|[{10506, Planemas...|{100, 100, 10504,...|{10525, Blocked, ...|
+--------------------+--------------------+--------------------+
only showing top 20 rows

In [191]:
df.createOrReplaceTempView("table")

In [194]:
df2 = spark.sql(
    """ 
    SELECT 
        explodedarray.*

    FROM table
    where explodedarray.icao_code is  null
    """
).show()

+----------+------------+--------+------------+------------+------------+-----------------+----------+--------+---------+----------------------+---------+---+------+----+
|airline_id|airline_name|callsign|country_iso2|country_name|date_founded|fleet_average_age|fleet_size|hub_code|iata_code|iata_prefix_accounting|icao_code| id|status|type|
+----------+------------+--------+------------+------------+------------+-----------------+----------+--------+---------+----------------------+---------+---+------+----+
+----------+------------+--------+------------+------------+------------+-----------------+----------+--------+---------+----------------------+---------+---+------+----+

In [23]:
df2 = spark.sql(
    """ 
    SELECT 
        explodedarray.airline_id,
        COALESCE(explodedarray.airline_name, "Unknown") as airline_name,
        COALESCE(explodedarray.iata_code,"N/A") as iata_code,
        COALESCE(explodedarray.iata_prefix_accounting,"N/A") as iata_prefix_accounting,
        COALESCE(explodedarray.icao_code,"N/A") as icao_code,

        COALESCE(explodedarray.country_iso2,"N/A") as country_iso2,
        COALESCE(explodedarray.country_name,"Unknown") as country_name,
        COALESCE(explodedarray.callsign,"N/A") as callsign,

        COALESCE(explodedarray.fleet_size,0) as fleet_size,
        COALESCE(explodedarray.fleet_average_age,0.0) as fleet_average_age,

        COALESCE(explodedarray.date_founded,0000) as date_founded,

        COALESCE(explodedarray.status,"Unknown") as status,
        COALESCE(explodedarray.type,"Unknown") as type

    FROM table
    where explodedarray.icao_code is  null
    """
).show()

+----------+------------+---------+----------------------+---------+------------+------------+--------+----------+-----------------+------------+------+----+
|airline_id|airline_name|iata_code|iata_prefix_accounting|icao_code|country_iso2|country_name|callsign|fleet_size|fleet_average_age|date_founded|status|type|
+----------+------------+---------+----------------------+---------+------------+------------+--------+----------+-----------------+------------+------+----+
+----------+------------+---------+----------------------+---------+------------+------------+--------+----------+-----------------+------------+------+----+

# 6. Flight Table

In [5]:
df = spark.read.json(r"C:\Users\karee\Downloads\file_2323_20250319_115001.json")

In [6]:
df.show()

+--------------------+--------------------+
|                data|          pagination|
+--------------------+--------------------+
|[{{B738, B738, 4B...|{100, 100, 2323, ...|
+--------------------+--------------------+

In [7]:
df= df.withColumn("explodedarray", explode(col('data')))
df.show()

+--------------------+--------------------+--------------------+
|                data|          pagination|       explodedarray|
+--------------------+--------------------+--------------------+
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{B738, B738, 4BA...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{A20N, A20N, 4BB...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{A21N, A21N, 4BC...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {XY, KNE, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{A21N, A21N, 4BC...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {PX, ANG, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {CG, TOK, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {UA, UAL, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {NULL, NUL...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {NH, ANA, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{A21N, A21N, 781...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{B738, B738, 780...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{{B748, B748, ABE...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {HO, DKH, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {GJ, CDC, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {G5, HXA, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {CZ, CSN, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {3U, CSC, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {NS, HBH, ...|
|[{{B738, B738, 4B...|{100, 100, 2323, ...|{NULL, {MU, CES, ...|
+--------------------+--------------------+--------------------+
only showing top 20 rows

In [8]:
df.createOrReplaceTempView("table")

In [54]:
df3= spark.sql(
    """
    SELECT DISTINCT 
        explodedarray.arrival.icao
    FROM table
    where explodedarray.flight.iata is null
    """).show()

+----+
|icao|
+----+
|YRTI|
+----+

In [ ]:
df2 = spark.sql(
    """
    SELECT 
    -- Flight attributes
    COALESCE(explodedarray.flight.iata, 'Unknown') AS flight_iata, --pk
    COALESCE(explodedarray.flight.icao, 'Unknown') AS flight_icao,
    COALESCE(explodedarray.flight.number, 0000) AS flight_number,
    COALESCE(explodedarray.flight_date, '0001-01-01') AS flight_date, -- Default date
    COALESCE(explodedarray.flight_status, 'Unknown') AS flight_status,

    -- Departure attributes
    COALESCE(explodedarray.departure.icao, 'Unknown') AS departure_icao, -- fk
    COALESCE(explodedarray.departure.terminal, 'N/A') AS departure_terminal,
    COALESCE(explodedarray.departure.gate, 'N/A') AS departure_gate,
    COALESCE(explodedarray.departure.scheduled, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) AS departure_scheduled,
    COALESCE(explodedarray.departure.actual, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) AS departure_actual,

    -- Arrival attributes
    COALESCE(explodedarray.arrival.icao, 'Unknown') AS arrival_icao, -- fk
    COALESCE(explodedarray.arrival.terminal, 'N/A') AS arrival_terminal,
    COALESCE(explodedarray.arrival.gate, 'N/A') AS arrival_gate,
    COALESCE(explodedarray.arrival.baggage, 'N/A') AS arrival_baggage,
    COALESCE(explodedarray.arrival.scheduled, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) AS arrival_scheduled,
    COALESCE(explodedarray.arrival.actual, CAST('0001-01-01T00:00:00.000Z' AS TIMESTAMP)) AS arrival_actual,

    -- Airline attributes
    COALESCE(explodedarray.airline.icao, 'Unknown') AS airline_icao, -- fk

    -- Aircraft attributes
    COALESCE(explodedarray.aircraft.registration, 'Unknown') AS aircraft_registration, -- fk
    COALESCE(explodedarray.aircraft.iata, 'Unknown') AS aircraft_iata,

    -- Live attributes
    COALESCE(explodedarray.live.is_ground, False) AS live_is_ground -- Default: False

FROM table
WHERE explodedarray.flight.iata IS NOT NULL
"""
).show()

SyntaxError: invalid syntax. Perhaps you forgot a comma? (2557941959.py, line 2)